---
kind: method
id: M:Autodesk.Revit.DB.Form.IsAutoCreaseEdge(Autodesk.Revit.DB.Reference)
zh: 对话框、窗口、窗体
source: html/753ceae9-4951-89c8-72fe-4c353490184e.htm
---
# Autodesk.Revit.DB.Form.IsAutoCreaseEdge Method

**中文**: 对话框、窗口、窗体

Tell if an edge is an auto-crease on a top/bottom cap face.

## Syntax (C#)
```csharp
public bool IsAutoCreaseEdge(
	Reference edgeReference
)
```

## Parameters
- **edgeReference** (`Autodesk.Revit.DB.Reference`) - The reference of the edge to be checked.